Revit 2027 API
ImageInstance.WidthScale Property
 The factor applied to the width of the ImageType to calculate the Width of the ImageInstance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WidthScale { get; set; }
Public Property WidthScale As Double
	Get
	Set
public:
property double WidthScale {
	double get ();
	void set (double value);
}
member WidthScale : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for widthScale results in a width that is more than 30000 feet. -or- When setting this property: The given value for widthScale results in a height that is more than 30000 feet because LockProportions is set to true.
ArgumentOutOfRangeException |  When setting this property: The given value for widthScale must be non-negative.
Remarks
 If LockProportions is true, then changes to the WidthScale will also result in changes to the HeightScale.
See Also
Reference
ImageInstance Class
Autodesk.Revit.DB Namespace